Repository: kit-g/heart-of-yours
Catalog: shared/heart_language/lib/l10n/intl_*.arb
Languages: ru

source: Appearance
ru: Внешний вид

source: Units
ru: Единицы измерения

# toLightMode
source: Light
ru: Светлая

# toDarkMode
source: Dark
ru: Темная

# toSystemMode
source: System
ru: Системная

source: Email
ru: Эл. почта

source: Your email
ru: Ваш email

source: Crop avatar
ru: Обрезать аватар

source: Name (optional)
ru: Имя (необязательно)

source: Name
ru: Имя

source: Save name
ru: Сохранить имя

source: Change name
ru: Изменить имя

source: Save
ru: Сохранить

source: Settings
ru: Настройки

source: Archive
ru: Архивировать

source: Unarchive
ru: Разархивировать

source: Password
ru: Пароль

source: Log in
ru: Войти

# logInTitle
source: Welcome Back
ru: С возвращением!

# logInBody
source: You've already started something important. Let's keep going.
ru: Вы уже начали что-то важное. Давайте продолжим!

# signUpTitle
source: Begin with Heart
ru: Начните с Heart

# signUpBody
source: Every journey starts with one decision. This one's yours.
ru: Каждое путешествие начинается с одного решения. Это — ваше.

# recoverTitle
source: Still with You
ru: Все еще с вами

# recoverBody
source: Your journey isn't lost. Just a moment of pause — we'll reset together.
ru: Ваш путь не потерян. Просто небольшая пауза — давайте начнем заново.

source: Log in with Google
ru: Войти через Google

source: Sign up with Google
ru: Зарегистрироваться через Google

source: Log in with Apple
ru: Войти через Apple

source: Sign up with Apple
ru: Зарегистрироваться через Apple

source: Log out
ru: Выйти

source: Profile
ru: Профиль

source: Workout
ru: Тренировка

source: History
ru: История

source: Exercises
ru: Упражнения

source: Search
ru: Поиск

# startNewWorkout
source: Start a new workout
ru: Начать новую тренировку

# cancelCurrentWorkoutTitle
source: Cancel current workout?
ru: Отменить текущую тренировку?

# cancelCurrentWorkoutBody
source: You have a workout in progress. Do you want to cancel it and start a new one?
ru: У вас есть незавершенная тренировка. Хотите отменить её и начать новую?

# startNewWorkoutFromTemplate
source: Start a new workout from this template?
ru: Начать новую тренировку по этому шаблону?

source: Start workout
ru: Начать тренировку

source: Cancel workout
ru: Отменить тренировку

source: Add exercises
ru: Добавить упражнения

source: Add set
ru: Добавить подход

source: New exercise
ru: Новое упражнение

source: Create new exercise
ru: Создать новое упражнение

source: Exercise options
ru: Настройки упражнения

source: Show archived
ru: Показать архивные

source: Archived exercises
ru: Архивные упражнения

# archiveConfirmTitle
source: Archive {exerciseName}?
ru: Архивировать {exerciseName}?

# archiveConfirmBody
source: This exercise will be moved to Archived Exercises (find it under Exercises → More → Show archived). Archiving won't affect any of your past workouts — your history stays intact.
ru: Это упражнение будет перемещено в Архивные упражнения (найти в Упражнения → Ещё → Показать архивные). Архивирование не повлияет на ваши прошлые тренировки — история останется без изменений.

# exerciseArchived
source: This exercise is archived and won't appear in your main library anymore.
ru: Это упражнение находится в архиве и больше не будет отображаться в основной библиотеке.

source: Delete set
ru: Удалить подход

source: Set
ru: Подход

source: Sets
ru: Подходы

source: Previous
ru: Предыдущий

source: Reps
ru: Повторения

source: Time
ru: Время

source: kg
ru: кг

source: mile
ru: миля

source: km
ru: км

# milesPlural
source: miles
ru: мили

# miles
source: {howMany,plural, =1{{howMany} mile}other{{howMany} miles}}
ru: {howMany,plural, =1{{howMany} миля}other{{howMany} мили}}

source: Edit
ru: Изменить

source: Delete
ru: Удалить

source: Repeat
ru: Повторить

source: Add
ru: Добавить

source: Share
ru: Поделиться

# okBang
source: Ok!
ru: Ок!

source: Cancel
ru: Отмена

source: Finish
ru: Завершить

source: Reset
ru: Сбросить

source: h
ru: ч

source: min
ru: мин

source: lbs
ru: фнт

source: Skip
ru: Пропустить

# lb
source: {howMany,plural, =1{{howMany} lb}other{{howMany} lbs}}
ru: {howMany,plural, =1{{howMany} фнт}other{{howMany} фнт}}

source: Save as template
ru: Сохранить как шаблон

# addNote
source: Add a note
ru: Добавить заметку

source: Replace exercise
ru: Заменить упражнение

# weightUnit
source: Weight
ru: Вес

# distanceUnit
source: Distance
ru: Расстояние

source: Duration
ru: Длительность

source: Imperial
ru: Имперская

source: Metric
ru: Метрическая

source: Rest timer
ru: Таймер отдыха

source: Cancel timer
ru: Отменить таймер

source: Remove exercise
ru: Удалить упражнение

source: Morning Workout
ru: Утренняя тренировка

source: Evening Workout
ru: Вечерняя тренировка

source: Night Workout
ru: Ночная тренировка

source: Afternoon Workout
ru: Дневная тренировка

# emptyHistoryTitle
source: Your completed workouts will be here
ru: Здесь будут ваши завершенные тренировки

# emptyHistoryBody
source: Go get them done!
ru: Вперед за тренировками!

# customThemeColorSetting
source: Custom theme color
ru: Пользовательский цвет темы

# customThemeColorSettingSubtitle
source: Used to generate a new theme
ru: Используется для создания новой темы

source: About app
ru: О приложении

source: Congratulations!
ru: Поздравляем!

# congratulationsBody
source: Your workout is complete!
ru: Ваша тренировка завершена!

# finishWorkoutTitle
source: Finish Workout?
ru: Завершить тренировку?

# finishWorkoutWarningTitle
source: Complete Your Workout?
ru: Завершить тренировку?

# finishWorkoutWarningBody
source: Any empty or invalid sets will be discarded, and all valid sets will be marked as completed.
ru: Пустые и некорректные подходы будут удалены, а все правильные будут отмечены как выполненные.

# finishWorkoutBody
source: Ready to finish this workout?
ru: Готовы завершить эту тренировку?

# cancelWorkoutBody
source: All progress made so far will be lost.
ru: Весь достигнутый прогресс будет потерян.

# cancelWorkoutTitle
source: Do you want to cancel this workout?
ru: Хотите отменить эту тренировку?

# readyToFinish
source: Yes, I'm done!
ru: Да, я закончил!

# keepCurrentAccount
source: No, keep current workout
ru: Нет, продолжить текущую тренировку

# cancelAndStartNewWorkout
source: Yes, cancel that one and start a new workout
ru: Да, отменить ту и начать новую тренировку

# resumeWorkout
source: No, resume workout
ru: Нет, продолжить тренировку

# deleteThis
source: Yes, delete this
ru: Да, удалить

source: Deleted
ru: Удалено

# notReadyToFinish
source: No, one more set!
ru: Нет, ещё один подход!

# deleteTemplateTitle
source: Do you want to delete this workout template?
ru: Хотите удалить этот шаблон тренировки?

# deleteTemplateBody
source: This cannot be undone
ru: Это действие нельзя отменить

source: Quit editing?
ru: Выйти из редактирования?

# changesWillBeLost
source: All changes will be lost
ru: Все изменения будут потеряны

# quitPage
source: Quit this page
ru: Покинуть страницу

source: Stay here
ru: Остаться здесь

source: Notification settings
ru: Настройки уведомлений

# selected
source: Selected {count}
ru: Выбрано {count}

source: for {exercise}
ru: для {exercise}

# restTimerSubtitle
source: Adjust duration via the +/- buttons.
ru: Настройте длительность с помощью кнопок +/-.

# addSeconds
source: +10s
ru: +10с

# subtractSeconds
source: -10s
ru: -10с

source: Rest complete!
ru: Отдых завершен!

# workoutsPerWeekTitle
source: Your workouts will be presented here
ru: Ваши тренировки будут отображаться здесь

# workoutsPerWeekBody
source: Go get them done!
ru: Вперед за тренировками!

source: Category
ru: Категория

source: Target
ru: Цель

source: Remove filter
ru: Удалить фильтр

# restCompleteBody
source: Next: {exercise}
ru: Следующее: {exercise}

source: Templates
ru: Шаблоны

source: Example templates
ru: Примеры шаблонов

source: Template
ru: Шаблон

source: New Template
ru: Новый шаблон

source: Edit Template
ru: Редактировать шаблон

source: Edit Workout
ru: Редактировать тренировку

source: Template name
ru: Название шаблона

source: Workout name
ru: Название тренировки

source: Cannot be empty
ru: Не может быть пустым

source: Show password
ru: Показать пароль

source: Hide password
ru: Скрыть пароль

source: Your password
ru: Ваш пароль

source: Reset password
ru: Сбросить пароль

# resetPasswordBody
source: We’ll send a reset link to your email faster than you can say “forgot my password.” No turning back after this—unless you cancel, of course. 😌
ru: Мы отправим ссылку для сброса пароля на ваш email быстрее, чем вы успеете сказать "забыл пароль". Назад пути нет — если только вы не отмените, конечно. 😌

# orConnector
source: - or -
ru: - или -

# invalidCredentials
source: Well, that didn't work! Double-check your details, eh?
ru: Что-то пошло не так! Проверьте ваши данные еще раз!

# weakPassword
source: Almost there! Try a stronger password to keep your account safe.
ru: Почти готово! Попробуйте более надежный пароль для безопасности вашего аккаунта.

source: Forgot password?
ru: Забыли пароль?

# noConnectivity
source: Uh-oh! The internet tripped over a dumbbell. 🏋️‍♂️ Try again in a sec!
ru: Ой! Интернет споткнулся о гантелю. 🏋️‍♂️ Попробуйте снова через секунду!

source: Sign up
ru: Регистрация

source: Send Reset Link
ru: Отправить ссылку для сброса

# recoveryLinkMessage
source: If an account exists for this email, you'll receive a reset link shortly. Check your inbox and spam folder.
ru: Если аккаунт с этим email существует, вы получите ссылку для сброса. Проверьте папку входящих и спам.

# recoveryLinkMessageSent
source: 💌Your password setup email is on its way! Check your inbox (or maybe your spam folder—it likes to hide).
ru: 💌Письмо для настройки пароля уже в пути! Проверьте входящие (или папку спам — оно любит там прятаться).

# emailExistsTitle
source: Email already exists
ru: Email уже существует

# emailExistsOkButton
source: Yes, sign me in!
ru: Да, войти!

# emailExistsCancelButton
source: No, I got this
ru: Нет, я разберусь

# emailExistsBody
source: An account with {address} already exists. Would you like to log in instead?
ru: Аккаунт с {address} уже существует. Хотите войти?

# sendResetLinkBody
source: Enter you email and we'll help you reset your password
ru: Введите ваш email и мы поможем сбросить пароль

# userDisabled
source: This account is disabled
ru: Этот аккаунт отключен

# unknownError
source: Unknown error occurred
ru: Произошла неизвестная ошибка

source: Account control
ru: Управление аккаунтом

source: Leave feedback
ru: Оставить отзыв

# leaveFeedbackBody
source: Snap a screenshot, doodle your feelings, and drop us a note. You can roam the app while you're at it. We love feedback. Every squiggle and comment helps us make the app better—for you and everyone else. So thanks. Seriously. {emoji}
ru: Сделайте скриншот, нарисуйте свои впечатления и оставьте нам заметку. Вы можете продолжать пользоваться приложением. Мы любим обратную связь. Каждый рисунок и комментарий помогает нам сделать приложение лучше — для вас и всех остальных. Так что спасибо. Серьезно. {emoji}

# feedbackReceived
source: Your feedback was received, thank you!
ru: Ваш отзыв получен, спасибо!

source: To feedback!
ru: К отзыву!

source: Danger zone
ru: Опасная зона

source: Delete account
ru: Удалить аккаунт

# deleteAccountTitle
source: Are you sure you want to delete your account?
ru: Вы уверены, что хотите удалить свой аккаунт?

# deleteAccountBody
source: Your account is scheduled for deletion in {deadline} days. During this time, you can still sign in and reverse this decision. Once the deadline has passed, your account and personal data will be permanently deleted.
ru: Ваш аккаунт запланирован на удаление через {deadline} дней. В течение этого времени вы все еще можете войти и отменить это решение. После истечения срока ваш аккаунт и личные данные будут удалены навсегда.

# deleteAccountCancelMessage
source: Oh no, I like it here!
ru: О нет, мне здесь нравится!

# deleteAccountConfirmMessage
source: Yep, go on without me!
ru: Да, продолжайте без меня!

# confirmDeleteAccountTitle
source: Confirm your account deletion
ru: Подтвердите удаление аккаунта

# confirmDeleteAccountCancelMessage
source: Changed my mind, cancel
ru: Передумал, отмена

# confirmDeleteAccountOkMessage
source: Farewell!
ru: Прощайте!

source: Account deleted
ru: Аккаунт удален

# accountDeletedBody
source: Your account has been scheduled for deletion on {date}. If you change your mind, you can restore your account anytime before this date. Simply click the button below to cancel the deletion and keep your account safe.
ru: Ваш аккаунт запланирован на удаление {date}. Если вы передумаете, вы можете восстановить свой аккаунт в любое время до этой даты. Просто нажмите кнопку ниже, чтобы отменить удаление и сохранить ваш аккаунт.

# accountDeletedAction
source: 🔥🏆 Undo the Goodbye 🥇🔥
ru: 🔥🏆 Отменить удаление 🥇🔥

source: About
ru: О приложении

source: Records
ru: Рекорды

source: Charts
ru: Графики

# emptyExerciseHistoryTitle
source: Ghost Reps Detected 👻
ru: Обнаружены призрачные повторения 👻

# emptyExerciseHistoryBody
source: Your exercise history is emptier than a gym on a Monday morning. Time to fill it up with some glorious PRs!
ru: Ваша история тренировок пуста как спортзал в понедельник утром. Пора заполнить ее личными рекордами!

# errorExerciseHistoryTitle
source: Oops! Someone Skipped the Data Day 🤷‍♀️
ru: Упс! Кто-то пропустил день данных 🤷‍♀️

# errorExerciseHistoryBody
source: Looks like the app tripped over its own shoelaces. Try again, and we promise to tie them tighter next time!
ru: Похоже, приложение споткнулось о свои шнурки. Попробуйте снова, и мы обещаем завязать их крепче в следующий раз!

source: Personal records
ru: Личные рекорды

source: Max duration
ru: Макс. длительность

source: Max distance
ru: Макс. дистанция

source: Max weight
ru: Макс. вес

source: Max reps
ru: Макс. повторений

# capturePhoto
source: Take a new photo
ru: Сделать новое фото

# chooseFromGallery
source: Choose from library
ru: Выбрать из галереи

source: Remove current photo
ru: Удалить текущее фото

source: Mine
ru: Мои

source: Go to Workout
ru: К тренировке

source: Set timer
ru: Установить таймер

# updateRequiredTitle
source: Oops. That one’s on us
ru: Упс! Это наша вина

# updateRequiredBody
source: There’s an important update waiting — one that keeps your app working as it should. You’ll need to install it before continuing. Thanks for your patience — and sorry for the interruption.
ru: Доступно важное обновление — оно необходимо для правильной работы приложения. Вам нужно установить его, чтобы продолжить. Спасибо за терпение — и извините за прерывание.

# updateRequiredCta
source: Update on the {storeName}
ru: Обновить в {storeName}

source: Add photo
ru: Добавить фото

source: Edit workout name
ru: Изменить название тренировки

source: Crop image
ru: Обрезать изображение

source: Remove photo
ru: Удалить фото

source: About exercise
ru: Об упражнении

source: My Dashboard
ru: Моя панель

source: New chart
ru: Новый график

# emptyChartStateTitle
source: Looks a little empty here
ru: Тут немного пусто

# emptyChartStateBody
source: Add your first set to start tracking real progress
ru: Добавьте первый подход чтобы начать отслеживать реальный прогресс

source: Top set weight
ru: Вес топового подхода

# estimatedOneRepMax
source: Estimated 1RM
ru: Расчетный 1ПМ

source: Total volume
ru: Общий объем

source: Average working weight
ru: Средний рабочий вес

source: Assistance weight
ru: Вес помощи

# maxRepsInSet
source: Max reps in a set
ru: Макс. повторений в подходе

source: Total reps
ru: Всего повторений

# cardioDistance
source: Distance
ru: Дистанция

# cardioDuration
source: Duration
ru: Длительность

source: Average pace
ru: Средний темп

source: Total time under tension
ru: Общее время под нагрузкой
